{"pageProps":{"post":{"mdxSource":{"compiledSource":"\"use strict\";\n\nvar _excluded = [\"components\"];\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, _excluded);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"In this post I'll cover my story. Not because it has great importance or anything, but because it could help somebody, I hope, to understand that is possible to switch career from a humanistic career to a technical one, up to become even an engineer (well, developing-code speaking at least).\"), mdx(\"p\", null, \"It was not somehow decided voluntarily. Circumstances made me make that choice, but I'm very happy that those happened. At the bottom of the post there are few tips I learnt along the way.\"), mdx(\"h2\", {\n    \"id\": \"before-the-tech\"\n  }, mdx(\"a\", {\n    parentName: \"h2\",\n    \"href\": \"#before-the-tech\",\n    \"aria-hidden\": \"true\",\n    \"tabIndex\": -1\n  }, mdx(\"span\", {\n    parentName: \"a\",\n    \"className\": \"icon icon-link\"\n  })), \"Before the tech\"), mdx(\"p\", null, \"I'm from Italy, I'm 35 at this moment and I got my first development job few months ago. Between 15 and 19 years old I studied in a technical high-school. At that time the best part of the curriculum about Informatics (that's how it was called) was some coding in C++. I'm saying this not because it helped my actual career, but just the opposite.\\nI didn't learn anything (the peak of knowledge was drawing with code some geometrical figures) and after school I forgot everything. I bought some C++ books at the time, but I got stuck at some concepts like pointers (geez I still remember those pages) and I was very bad at math. So the interest and curiosity about programming just died there.\"), mdx(\"p\", null, \"Fast forward, I took humanistic studies at the university, because I liked them more, and I was more prone and good at them. Eventually, I moved to Latin America and I started teaching languages, passed to commercial work in a language school, then take over the academic part of it.\"), mdx(\"p\", null, \"That lasted few years, and eventually I decided with my wife to go back to Europe. We tried Italy with no success and after a little while I decided to accept a Service Desk position in a multinational company in Czech Republic. I mean, I understood a little how PCs are working and something else about the internet, so why not?\"), mdx(\"p\", null, \"There I did the most basic technical support. But I was always willing to learn, even so because I had night shifts as well. I passed many uneventful hours to study (I did a short nap sometimes and I have also eaten though). At that time I didn't know what directions to take, not even which field to specialise on (I didn't even know devops was a thing), so I started with SQL and Unix command line. I'm not sure what triggered this idea, and why these specific fields.\"), mdx(\"p\", null, \"These two skills were fundamental to my change of job and company. As a matter of fact, in the next one I started from a so-called level 1.5. It was an intermediate level between service desk and level 2, which is basically operations and maintenance. I had the luck that comparing to the level 2 of other companies which are providing very specific software support, in my new one I could have hands-on on exactly those skills I studied earlier.\"), mdx(\"p\", null, \"A point here to make: all your knowledge is building on top of the knowledge you already have. The service desk was built on my high-school and passion skillset; the new job on what I built before, including corporate tech bureaucracy and procedures. And so on and so forth.\"), mdx(\"p\", null, \"Building more knowledge on SQL and Unix allowed me to get promoted quickly, passing to L2.\\nFor that particular project, it meant that I had to open up to a little of everything: investigation, analysis, data manipulation, deployments. And I had to know all the infrastructure, from the databases to the proxies, to the endpoints, oracle bus services and so on. I didn't have access to the code itself of the applications (which were written in Java), only the exceptions and similar during the log analysis.\"), mdx(\"p\", null, \"However, the broad scope of the team allowed me and my colleagues to think about automating things, and we had free hand to use whatever was more fitting. So I started learning development, with Freecodecamp as initial resource, and complementing it with a course (just one? Yeah...) on Udemy. I finished the latter, but about the former I managed to go through the curriculum until the frontend projects. I didn't complete those one though, as it was about time to put knowledge into work-related projects (it also rhymes right?!).\"), mdx(\"p\", null, \"First and foremost I created my website with the tools I had. At the time I was not familiar with React so I did it in NodeJS with EJS as template engine (Javascript embedded into HTML). Secondly I started doing the project for work, still in Node (which was then my favourite thing to work with, and still is).\"), mdx(\"p\", null, \"So I built an automation tool that allowed me or my colleagues to upload a file on a server of ours, and with just a simple interface and few clicks deploy a third-party vendor software and sync it with all servers. Of course, looking retrospectively, the code I wrote was very bad and with ....some... untracked bugs. But it worked fine, although almost never crashed (just sometimes had to be double-checked) it was reliable and allowed the team to save hours of manual work.\"), mdx(\"p\", null, \"That's just one example of what can be done. I followed with other small projects, eventually in React, so that I could apply what I was learning in real world applications.\"), mdx(\"p\", null, \"Meanwhile I became a father of a very very active boy, so the time lessened more and more. But I continued to cut little pieces of time here and there to continue to learn.\"), mdx(\"p\", null, \"Eventually our team was 'transformed' and we were assigned different scopes. So I decided to hit the road and start applying to developer jobs. I used the tactic of quality over quantity. That means not applying randomly and en-mass, but selecting what I could actually do on the offers; check the company website, what were they doing; personalize a cover letter accordingly highlighting how could I help with my skills.\"), mdx(\"p\", null, \"Before landing my actual job, I maybe applied to only 30 offers, or even less. And that was when Covid hit (so companies stopped hiring and started firing).\"), mdx(\"p\", null, \"The best part of the interviewing process were the projects at home. I did have few board interviews, some went well, some less, but generally I enjoyed them because every time I was learning something new.\\nThat's why it's said to start applying early in time, not to wait indefinitely that the knowledge of the language gets very good or excellent (which won't happen anyway in this phase). I actually waited too long.\"), mdx(\"p\", null, \"Luckily I had many complete and detailed reviews (rejected) from my take home projects. From each I learnt something. Then from my actual company they were looking for a frontend developer. At the first interview I got already some experience on this aspect, and they proposed take home projects for both frontend and backend (Node). I decided to take them both. That's when persistence, enthusiasm and good will make a good impression on the candidates.\"), mdx(\"p\", null, \"I actually failed twice on the FE position, but I insisted and got accepted on the BE one.\"), mdx(\"h2\", {\n    \"id\": \"lessons-learnt\"\n  }, mdx(\"a\", {\n    parentName: \"h2\",\n    \"href\": \"#lessons-learnt\",\n    \"aria-hidden\": \"true\",\n    \"tabIndex\": -1\n  }, mdx(\"span\", {\n    parentName: \"a\",\n    \"className\": \"icon icon-link\"\n  })), \"Lessons learnt\"), mdx(\"ol\", null, mdx(\"li\", null, \"Don't give up. Every failure is a lesson learnt. You don't know how far is the goal but you are always one step closer.\"), mdx(\"li\", null, \"If you come from other fields you can have the advantage of thinking more creatively. It's possible to find association of concepts. Sometimes it's easier to adapt some solutions from other jobs to the developer one. In my case it helped to know more (spoken) languages. Knowing the deep structure (philology curriculum at university) of a language helps understand some logic in the programming language (after all, it's all made by humans)\"), mdx(\"li\", null, \"If you come from any humanistic field, usually you have developed some good 'soft' skills -or 'human' skills - especially communication, which is of great importance in a team.\", ' '), mdx(\"li\", null, \"You don't have to push yourself aggressively to the companies; persistence comes with gracefulness. But I found that after a review, if there's space for improvement, you can correct and fix your project and send it back to evaluate. There's nothing to lose, actually it'll make a good impression, even if not successful. Just be sure to not send back a project that you know for certain it will be rejected. People's time is valuable.\"), mdx(\"li\", null, \"Sometimes the reviews are even difficult to understand, or you have no idea what some things actually mean. Give up on those and thank them, it means the requirements were actually higher than you thought.\"), mdx(\"li\", null, \"Always thank the company after the rejection. They spent a lot of time reviewing your code and your CV, appreciate that.\"), mdx(\"li\", null, \"If they didn't give you a review after a rejection, thank them but try to ask them for it. Maybe they'll refuse, or ignore you, but possibly they'll send it to you, and you'll learn from a good senior developer review.\"), mdx(\"li\", null, \"Don't bother to insist with companies that don't give you any news at all, good or bad. It's a bad sign.\")), mdx(\"p\", null, \"Feel free to drop any questions or comment!\"));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<p>In this post I&#x27;ll cover my story. Not because it has great importance or anything, but because it could help somebody, I hope, to understand that is possible to switch career from a humanistic career to a technical one, up to become even an engineer (well, developing-code speaking at least).</p><p>It was not somehow decided voluntarily. Circumstances made me make that choice, but I&#x27;m very happy that those happened. At the bottom of the post there are few tips I learnt along the way.</p><h2 id=\"before-the-tech\"><a href=\"#before-the-tech\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Before the tech</h2><p>I&#x27;m from Italy, I&#x27;m 35 at this moment and I got my first development job few months ago. Between 15 and 19 years old I studied in a technical high-school. At that time the best part of the curriculum about Informatics (that&#x27;s how it was called) was some coding in C++. I&#x27;m saying this not because it helped my actual career, but just the opposite.\nI didn&#x27;t learn anything (the peak of knowledge was drawing with code some geometrical figures) and after school I forgot everything. I bought some C++ books at the time, but I got stuck at some concepts like pointers (geez I still remember those pages) and I was very bad at math. So the interest and curiosity about programming just died there.</p><p>Fast forward, I took humanistic studies at the university, because I liked them more, and I was more prone and good at them. Eventually, I moved to Latin America and I started teaching languages, passed to commercial work in a language school, then take over the academic part of it.</p><p>That lasted few years, and eventually I decided with my wife to go back to Europe. We tried Italy with no success and after a little while I decided to accept a Service Desk position in a multinational company in Czech Republic. I mean, I understood a little how PCs are working and something else about the internet, so why not?</p><p>There I did the most basic technical support. But I was always willing to learn, even so because I had night shifts as well. I passed many uneventful hours to study (I did a short nap sometimes and I have also eaten though). At that time I didn&#x27;t know what directions to take, not even which field to specialise on (I didn&#x27;t even know devops was a thing), so I started with SQL and Unix command line. I&#x27;m not sure what triggered this idea, and why these specific fields.</p><p>These two skills were fundamental to my change of job and company. As a matter of fact, in the next one I started from a so-called level 1.5. It was an intermediate level between service desk and level 2, which is basically operations and maintenance. I had the luck that comparing to the level 2 of other companies which are providing very specific software support, in my new one I could have hands-on on exactly those skills I studied earlier.</p><p>A point here to make: all your knowledge is building on top of the knowledge you already have. The service desk was built on my high-school and passion skillset; the new job on what I built before, including corporate tech bureaucracy and procedures. And so on and so forth.</p><p>Building more knowledge on SQL and Unix allowed me to get promoted quickly, passing to L2.\nFor that particular project, it meant that I had to open up to a little of everything: investigation, analysis, data manipulation, deployments. And I had to know all the infrastructure, from the databases to the proxies, to the endpoints, oracle bus services and so on. I didn&#x27;t have access to the code itself of the applications (which were written in Java), only the exceptions and similar during the log analysis.</p><p>However, the broad scope of the team allowed me and my colleagues to think about automating things, and we had free hand to use whatever was more fitting. So I started learning development, with Freecodecamp as initial resource, and complementing it with a course (just one? Yeah...) on Udemy. I finished the latter, but about the former I managed to go through the curriculum until the frontend projects. I didn&#x27;t complete those one though, as it was about time to put knowledge into work-related projects (it also rhymes right?!).</p><p>First and foremost I created my website with the tools I had. At the time I was not familiar with React so I did it in NodeJS with EJS as template engine (Javascript embedded into HTML). Secondly I started doing the project for work, still in Node (which was then my favourite thing to work with, and still is).</p><p>So I built an automation tool that allowed me or my colleagues to upload a file on a server of ours, and with just a simple interface and few clicks deploy a third-party vendor software and sync it with all servers. Of course, looking retrospectively, the code I wrote was very bad and with ....some... untracked bugs. But it worked fine, although almost never crashed (just sometimes had to be double-checked) it was reliable and allowed the team to save hours of manual work.</p><p>That&#x27;s just one example of what can be done. I followed with other small projects, eventually in React, so that I could apply what I was learning in real world applications.</p><p>Meanwhile I became a father of a very very active boy, so the time lessened more and more. But I continued to cut little pieces of time here and there to continue to learn.</p><p>Eventually our team was &#x27;transformed&#x27; and we were assigned different scopes. So I decided to hit the road and start applying to developer jobs. I used the tactic of quality over quantity. That means not applying randomly and en-mass, but selecting what I could actually do on the offers; check the company website, what were they doing; personalize a cover letter accordingly highlighting how could I help with my skills.</p><p>Before landing my actual job, I maybe applied to only 30 offers, or even less. And that was when Covid hit (so companies stopped hiring and started firing).</p><p>The best part of the interviewing process were the projects at home. I did have few board interviews, some went well, some less, but generally I enjoyed them because every time I was learning something new.\nThat&#x27;s why it&#x27;s said to start applying early in time, not to wait indefinitely that the knowledge of the language gets very good or excellent (which won&#x27;t happen anyway in this phase). I actually waited too long.</p><p>Luckily I had many complete and detailed reviews (rejected) from my take home projects. From each I learnt something. Then from my actual company they were looking for a frontend developer. At the first interview I got already some experience on this aspect, and they proposed take home projects for both frontend and backend (Node). I decided to take them both. That&#x27;s when persistence, enthusiasm and good will make a good impression on the candidates.</p><p>I actually failed twice on the FE position, but I insisted and got accepted on the BE one.</p><h2 id=\"lessons-learnt\"><a href=\"#lessons-learnt\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Lessons learnt</h2><ol><li>Don&#x27;t give up. Every failure is a lesson learnt. You don&#x27;t know how far is the goal but you are always one step closer.</li><li>If you come from other fields you can have the advantage of thinking more creatively. It&#x27;s possible to find association of concepts. Sometimes it&#x27;s easier to adapt some solutions from other jobs to the developer one. In my case it helped to know more (spoken) languages. Knowing the deep structure (philology curriculum at university) of a language helps understand some logic in the programming language (after all, it&#x27;s all made by humans)</li><li>If you come from any humanistic field, usually you have developed some good &#x27;soft&#x27; skills -or &#x27;human&#x27; skills - especially communication, which is of great importance in a team.<!-- --> </li><li>You don&#x27;t have to push yourself aggressively to the companies; persistence comes with gracefulness. But I found that after a review, if there&#x27;s space for improvement, you can correct and fix your project and send it back to evaluate. There&#x27;s nothing to lose, actually it&#x27;ll make a good impression, even if not successful. Just be sure to not send back a project that you know for certain it will be rejected. People&#x27;s time is valuable.</li><li>Sometimes the reviews are even difficult to understand, or you have no idea what some things actually mean. Give up on those and thank them, it means the requirements were actually higher than you thought.</li><li>Always thank the company after the rejection. They spent a lot of time reviewing your code and your CV, appreciate that.</li><li>If they didn&#x27;t give you a review after a rejection, thank them but try to ask them for it. Maybe they&#x27;ll refuse, or ignore you, but possibly they&#x27;ll send it to you, and you&#x27;ll learn from a good senior developer review.</li><li>Don&#x27;t bother to insist with companies that don&#x27;t give you any news at all, good or bad. It&#x27;s a bad sign.</li></ol><p>Feel free to drop any questions or comment!</p>","scope":{}},"frontMatter":{"wordCount":1540,"readingTime":{"text":"8 min read","minutes":7.69,"time":461400.00000000006,"words":1538},"slug":"how-transitioned-from-humanistic-to-tech-and-helped","fileName":"how-transitioned-from-humanistic-to-tech-and-helped.md","title":"How I transitioned from humanistic jobs to tech and development and why it is possible to start from the basics.","date":"2020-12-02","draft":false,"tags":["insights"],"summary":"Transitioning from literature and languages to tech was not easy. Making a career from basic roles to developer is possible, and even better sometimes."}},"prev":{"title":"Mock an Axios call with a JSON file.","date":"2020-11-13","draft":false,"tags":["nodejs","web development","api"],"summary":"How to avoid test calling a third party API with Axios using a mock JSON file","slug":"sending-mock-json-response-axios"},"next":{"title":"Useful GIT commands","date":"2021-01-26","tags":["git","web development"],"draft":false,"summary":"Useful commands to use in git in everyday working life","slug":"useful-git-commands"}},"__N_SSG":true}