{"pageProps":{"post":{"mdxSource":{"compiledSource":"\"use strict\";\n\nvar _excluded = [\"components\"];\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsxRuntime classic */\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, _excluded);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"I'm over a year working professionally as a developer.\"), mdx(\"p\", null, \"I was supposed to write the first lessons learnt after three months into my work. But time passed, and so here it is with the experience of a couple (10) more months.\\nHowever, I think that what I learnt can be divided in two: my first six months, and after six months.\"), mdx(\"p\", null, \"In my first half year, not only I was a newbie in coding, but I had to get used to tons of stuff that I never used: git flow in teams and docker to begin with.\"), mdx(\"p\", null, \"After that, I got somewhat more familiar with all the technologies, so it was easier to concentrate on coding.\"), mdx(\"h2\", {\n    \"id\": \"before-i-got-hired\"\n  }, mdx(\"a\", {\n    parentName: \"h2\",\n    \"href\": \"#before-i-got-hired\",\n    \"aria-hidden\": \"true\",\n    \"tabIndex\": -1\n  }, mdx(\"span\", {\n    parentName: \"a\",\n    \"className\": \"icon icon-link\"\n  })), \"Before I got hired\"), mdx(\"p\", null, \"My story about getting a developer job is coming from a long way in the past. I wrote about it \", mdx(\"a\", {\n    href: \"https://buaiscia.github.io/blog/how-transitioned-from-humanistic-to-tech-and-helped\"\n  }, \"here.\")), mdx(\"p\", null, \"What I learnt in the one or two years of self teaching development were the basics: how to create something simple in a linear order, and some styling.\"), mdx(\"p\", null, \"I also learnt through examples and a lot of Stack overflow 'investigation' how to put things somehow together and make it work.\"), mdx(\"p\", null, \"A lot of copy paste not working and lots of sweat to make it work. Eventually, a big satisfaction of giving birth to something useful.\\nI also learnt how to use databases and connect a backend to them and then to a frontend. Enough to try take-home projects for the interviews and fail almost all of them. But as they say, it takes one to make it worth it.\"), mdx(\"h2\", {\n    \"id\": \"one-month-before-the-job-starts\"\n  }, mdx(\"a\", {\n    parentName: \"h2\",\n    \"href\": \"#one-month-before-the-job-starts\",\n    \"aria-hidden\": \"true\",\n    \"tabIndex\": -1\n  }, mdx(\"span\", {\n    parentName: \"a\",\n    \"className\": \"icon icon-link\"\n  })), \"One month before the job starts\"), mdx(\"p\", null, \"Once I got hired, I did what was not 'explicitly' requested, but I think is a good approach (especially for your future self).\"), mdx(\"p\", null, \"I got in touch with my future colleagues so they could tell me what I should improve, or what tech stack should I add to my knowledge before the first day of work.\"), mdx(\"p\", null, \"Of course it's all theoretical because you don't really know anything about the project you'll work on. But having a good starting point saves you a lot of time in the first month.\"), mdx(\"p\", null, \"In my case was especially Typescript. I never used it before, so I took the opportunity. I had the documentation always opened and I took a brief Udemy course. I transformed everything to Typescript in my take-home assignment that I made for my initial interview.\\nI had a list of technologies used by the team to check upon; I had maybe knowledge of two thirds of them but good enough skills on one third. The rest I just remotely heard they were existing.\"), mdx(\"h2\", {\n    \"id\": \"the-first-six-months\"\n  }, mdx(\"a\", {\n    parentName: \"h2\",\n    \"href\": \"#the-first-six-months\",\n    \"aria-hidden\": \"true\",\n    \"tabIndex\": -1\n  }, mdx(\"span\", {\n    parentName: \"a\",\n    \"className\": \"icon icon-link\"\n  })), \"The first six months\"), mdx(\"p\", null, \"How would I describe it? At least overwhelming. Where I live, since you start a new position, you usually enter a three months period called trial or probation period. In that, you and the company have to decide whether you're a good fit to each other.\"), mdx(\"p\", null, \"And each other have the right to leave with a 2 weeks notice. I know that's a lot less stressful than other countries, for example, as far as I know, the USA, where the 2 weeks are a permanent notice time. But still, that makes this time particularly sensitive.\\nEspecially passing from a senior position (my previous job as application support engineer) to a junior one where I had to prove myself.\"), mdx(\"p\", null, \"It came to the first days where, apart from the initial setup, I had to get familiar with the codebase I had to work on.\\nAnd then... apart from one small ticket for a small change, I was given the assignment to r-e-f-a-c-t-o-r the whole codebase. \\uD83E\\uDD2F\"), mdx(\"p\", null, \"That one came from some older vendor and my company took it, improved it a little and added the requested features.\\nBut it was over complicated, with lots of useless code. So yeah, they told me, just rewrite it from scratch using Typescript.\"), mdx(\"p\", null, \"I confess I had my moments of panic. Frustration, impatience, other negative feelings here and there.\\nEspecially with the first PRs (pull requests in Github) which were reviewed with tons of comments on how to do things differently, or change code, or delete parts and remake others.\"), mdx(\"p\", null, \"Well guess what? It was the best exercise ever. It allowed me to know from top to bottom the code, and slowly improving the quality of my programming, applying DRY and SOLID principles, algorithms, and so on.\"), mdx(\"p\", null, \"Sometimes I had to remake things 3 or 4 times before having a good version.\\nEventually, for that particular project, I had only few, more 'coding style' corrections.\"), mdx(\"p\", null, \"That doesn't mean I was writing code as good as my colleagues but it was an amazing progress for me.\\nOf course, this wouldn't have been possible if I wouldn't have the most understanding colleagues, experienced and patient with all my questions and misunderstandings.\"), mdx(\"h2\", {\n    \"id\": \"some-of-the-lessons-learnt\"\n  }, mdx(\"a\", {\n    parentName: \"h2\",\n    \"href\": \"#some-of-the-lessons-learnt\",\n    \"aria-hidden\": \"true\",\n    \"tabIndex\": -1\n  }, mdx(\"span\", {\n    parentName: \"a\",\n    \"className\": \"icon icon-link\"\n  })), \"Some of the lessons learnt\"), mdx(\"ol\", null, mdx(\"li\", null, \"Have patience with yourself. If they hire you as a junior nobody is expecting miracles. Take it one day at the time.\"), mdx(\"li\", null, \"You can make some speficic skills-targets. For example, this week I'll focus on Wepack, so at the end I'll know how to set it up. Or, as another example, today I'll take my time to figure out how to rebase the dev branch with my branch correctly, resolving all merge conflicts. When you are a junior, you can tell your colleagues that you'll take some time to understand how to do a thing. They'll be happy once you'll manage, because it'll save them more time, trouble and explanations in the future!\"), mdx(\"li\", null, \"Don't lose temper with your colleagues even if they seem impatient with you. Sometime they're under pressure from the customer or the managers and they're just shielding you from some storm.\"), mdx(\"li\", null, \"Related but as important: your colleagues are your best allies\"), mdx(\"li\", null, \"Don't suppose that your code is perfect because it's working. First, a second pair of eyes will find bugs here and there. Second, there's always some ways to make the code cleaner and more readable. What you don't know, you don't know and can't see. So always suppose that the code will be corrected.\"), mdx(\"li\", null, \"I am the type that passes hours trying to solve a bug because it's a question of self pride. If you don't have this, ask if you're stuck (but anyway try as much as possible by yourself, your colleagues are busy)\"), mdx(\"li\", null, \"As mentioned, there is a ton of tools and tech that you don't use when you learn to code. For example, the whole git flow with a team (with PRs, merge, rebase, cherry-pick, all with conflicts resolutions because other people are merging their PRs); then setting up DBs(preview, modify, type them; containerization; webpack/gulp and so on for bundling and minifying; sprint planning and estimations; and the list goes on. But, all these are not expected to be known in the beginning. It takes a little time, and patience from all colleagues, and they'll click together.\"), mdx(\"li\", null, \"No developer knows everything, everybody googles and do research. New technologies are coming out continuously, or they have to implement a tech stack they don't know. So everybody do tests and mistakes. But, what is different with a senior dev, is how they are quicker because they know what to look for. And then, they understand how to implement it. A junior developer does it by trial and mistake, but by doing so, they gain every time a little more experience on how things are working. That's how a dev slowly transition from junior to senior.\")));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<p>I&#x27;m over a year working professionally as a developer.</p><p>I was supposed to write the first lessons learnt after three months into my work. But time passed, and so here it is with the experience of a couple (10) more months.\nHowever, I think that what I learnt can be divided in two: my first six months, and after six months.</p><p>In my first half year, not only I was a newbie in coding, but I had to get used to tons of stuff that I never used: git flow in teams and docker to begin with.</p><p>After that, I got somewhat more familiar with all the technologies, so it was easier to concentrate on coding.</p><h2 id=\"before-i-got-hired\"><a href=\"#before-i-got-hired\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Before I got hired</h2><p>My story about getting a developer job is coming from a long way in the past. I wrote about it <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://buaiscia.github.io/blog/how-transitioned-from-humanistic-to-tech-and-helped\">here.</a></p><p>What I learnt in the one or two years of self teaching development were the basics: how to create something simple in a linear order, and some styling.</p><p>I also learnt through examples and a lot of Stack overflow &#x27;investigation&#x27; how to put things somehow together and make it work.</p><p>A lot of copy paste not working and lots of sweat to make it work. Eventually, a big satisfaction of giving birth to something useful.\nI also learnt how to use databases and connect a backend to them and then to a frontend. Enough to try take-home projects for the interviews and fail almost all of them. But as they say, it takes one to make it worth it.</p><h2 id=\"one-month-before-the-job-starts\"><a href=\"#one-month-before-the-job-starts\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>One month before the job starts</h2><p>Once I got hired, I did what was not &#x27;explicitly&#x27; requested, but I think is a good approach (especially for your future self).</p><p>I got in touch with my future colleagues so they could tell me what I should improve, or what tech stack should I add to my knowledge before the first day of work.</p><p>Of course it&#x27;s all theoretical because you don&#x27;t really know anything about the project you&#x27;ll work on. But having a good starting point saves you a lot of time in the first month.</p><p>In my case was especially Typescript. I never used it before, so I took the opportunity. I had the documentation always opened and I took a brief Udemy course. I transformed everything to Typescript in my take-home assignment that I made for my initial interview.\nI had a list of technologies used by the team to check upon; I had maybe knowledge of two thirds of them but good enough skills on one third. The rest I just remotely heard they were existing.</p><h2 id=\"the-first-six-months\"><a href=\"#the-first-six-months\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>The first six months</h2><p>How would I describe it? At least overwhelming. Where I live, since you start a new position, you usually enter a three months period called trial or probation period. In that, you and the company have to decide whether you&#x27;re a good fit to each other.</p><p>And each other have the right to leave with a 2 weeks notice. I know that&#x27;s a lot less stressful than other countries, for example, as far as I know, the USA, where the 2 weeks are a permanent notice time. But still, that makes this time particularly sensitive.\nEspecially passing from a senior position (my previous job as application support engineer) to a junior one where I had to prove myself.</p><p>It came to the first days where, apart from the initial setup, I had to get familiar with the codebase I had to work on.\nAnd then... apart from one small ticket for a small change, I was given the assignment to r-e-f-a-c-t-o-r the whole codebase. 🤯</p><p>That one came from some older vendor and my company took it, improved it a little and added the requested features.\nBut it was over complicated, with lots of useless code. So yeah, they told me, just rewrite it from scratch using Typescript.</p><p>I confess I had my moments of panic. Frustration, impatience, other negative feelings here and there.\nEspecially with the first PRs (pull requests in Github) which were reviewed with tons of comments on how to do things differently, or change code, or delete parts and remake others.</p><p>Well guess what? It was the best exercise ever. It allowed me to know from top to bottom the code, and slowly improving the quality of my programming, applying DRY and SOLID principles, algorithms, and so on.</p><p>Sometimes I had to remake things 3 or 4 times before having a good version.\nEventually, for that particular project, I had only few, more &#x27;coding style&#x27; corrections.</p><p>That doesn&#x27;t mean I was writing code as good as my colleagues but it was an amazing progress for me.\nOf course, this wouldn&#x27;t have been possible if I wouldn&#x27;t have the most understanding colleagues, experienced and patient with all my questions and misunderstandings.</p><h2 id=\"some-of-the-lessons-learnt\"><a href=\"#some-of-the-lessons-learnt\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Some of the lessons learnt</h2><ol><li>Have patience with yourself. If they hire you as a junior nobody is expecting miracles. Take it one day at the time.</li><li>You can make some speficic skills-targets. For example, this week I&#x27;ll focus on Wepack, so at the end I&#x27;ll know how to set it up. Or, as another example, today I&#x27;ll take my time to figure out how to rebase the dev branch with my branch correctly, resolving all merge conflicts. When you are a junior, you can tell your colleagues that you&#x27;ll take some time to understand how to do a thing. They&#x27;ll be happy once you&#x27;ll manage, because it&#x27;ll save them more time, trouble and explanations in the future!</li><li>Don&#x27;t lose temper with your colleagues even if they seem impatient with you. Sometime they&#x27;re under pressure from the customer or the managers and they&#x27;re just shielding you from some storm.</li><li>Related but as important: your colleagues are your best allies</li><li>Don&#x27;t suppose that your code is perfect because it&#x27;s working. First, a second pair of eyes will find bugs here and there. Second, there&#x27;s always some ways to make the code cleaner and more readable. What you don&#x27;t know, you don&#x27;t know and can&#x27;t see. So always suppose that the code will be corrected.</li><li>I am the type that passes hours trying to solve a bug because it&#x27;s a question of self pride. If you don&#x27;t have this, ask if you&#x27;re stuck (but anyway try as much as possible by yourself, your colleagues are busy)</li><li>As mentioned, there is a ton of tools and tech that you don&#x27;t use when you learn to code. For example, the whole git flow with a team (with PRs, merge, rebase, cherry-pick, all with conflicts resolutions because other people are merging their PRs); then setting up DBs(preview, modify, type them; containerization; webpack/gulp and so on for bundling and minifying; sprint planning and estimations; and the list goes on. But, all these are not expected to be known in the beginning. It takes a little time, and patience from all colleagues, and they&#x27;ll click together.</li><li>No developer knows everything, everybody googles and do research. New technologies are coming out continuously, or they have to implement a tech stack they don&#x27;t know. So everybody do tests and mistakes. But, what is different with a senior dev, is how they are quicker because they know what to look for. And then, they understand how to implement it. A junior developer does it by trial and mistake, but by doing so, they gain every time a little more experience on how things are working. That&#x27;s how a dev slowly transition from junior to senior.</li></ol>","scope":{}},"frontMatter":{"wordCount":1274,"readingTime":{"text":"7 min read","minutes":6.36,"time":381600,"words":1272},"slug":"what-learnt-in-first-four-months-self-taught-developer","fileName":"what-learnt-in-first-four-months-self-taught-developer.mdx","title":"What I learnt in my first six months as a working (self-taught) developer","date":"2021-07-06","template":"post","draft":false,"tags":["insights"],"summary":""}},"prev":{"title":"Useful GIT commands","date":"2021-01-26","tags":["git","web development"],"draft":false,"summary":"Useful commands to use in git in everyday working life","slug":"useful-git-commands"},"next":null},"__N_SSG":true}